results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation2/results-40.txt
[OVERALL], RunTime(ms), 51408
[OVERALL], Throughput(ops/sec), 1945.2225334578275
[TOTAL_GCS_G1_Young_Generation], Count, 22
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 370
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7197323373793962
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 370
[TOTAL_GC_TIME_%], Time(%), 0.7197323373793962
[READ], Operations, 49842
[READ], AverageLatency(us), 16532.819309016493
[READ], MinLatency(us), 85
[READ], MaxLatency(us), 4955719
[READ], Return=OK, 49842
[READ], 0, 47279.950326797385
[READ], 1000, 13975.673449612403
[READ], 2000, 11251.223954060706
[READ], 3000, 42464.8116089613
[READ], 4000, 18560.089721254357
[READ], 5000, 13951.58153580673
[READ], 6000, 7464.287287287288
[READ], 7000, 39877.26443768997
[READ], 8000, 14413.68761904762
[READ], 9000, 6374.980188679246
[READ], 10000, 29975.573891625616
[READ], 11000, 15841.61954887218
[READ], 12000, 15498.86671686747
[READ], 13000, 17420.90990990991
[READ], 14000, 18668.87235996327
[READ], 15000, 23344.442916093536
[READ], 16000, 22033.95605573419
[READ], 17000, 12615.381875
[READ], 18000, 14250.828171091445
[READ], 19000, 18061.10185185185
[READ], 20000, 13156.289700996678
[READ], 21000, 13816.864314789687
[READ], 22000, 12219.084610259826
[READ], 23000, 14030.981989708405
[READ], 24000, 17383.2681359045
[READ], 25000, 15065.884644194757
[READ], 26000, 14849.00572831424
[READ], 27000, 13177.473647224175
[READ], 28000, 14461.127238454288
[READ], 29000, 24556.565947242205
[READ], 30000, 16364.176470588236
[READ], 31000, 79687.14285714286
[READ], 32000, 17197.318652849743
[READ], 33000, 18311.934530095037
[READ], 34000, 14332.790372670808
[READ], 35000, 12959.79485049834
[READ], 36000, 9976.090655509066
[READ], 37000, 15334.66633266533
[READ], 38000, 12750.232044198896
[READ], 39000, 19116.598930481283
[READ], 40000, 13214.981185324554
[READ], 41000, 10530.260984182776
[READ], 42000, 7592.142167011732
[READ], 43000, 9512.31783919598
[READ], 44000, 9774.58695652174
[READ], 45000, 8002.397350993378
[READ], 46000, 6119.655279503106
[READ], 47000, 5293.1875
[CLEANUP], Operations, 40
[CLEANUP], AverageLatency(us), 1.225
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 7
[CLEANUP], 0, 1.0
[CLEANUP], 1000, 1.0
[CLEANUP], 3000, 1.0
[CLEANUP], 6000, 1.0
[CLEANUP], 12000, 0.0
[CLEANUP], 13000, 2.5
[CLEANUP], 14000, 4.0
[CLEANUP], 16000, 1.3333333333333333
[CLEANUP], 17000, 1.0
[CLEANUP], 18000, 1.0
[CLEANUP], 19000, 1.0
[CLEANUP], 20000, 0.8
[CLEANUP], 21000, 1.1666666666666667
[CLEANUP], 22000, 0.0
[CLEANUP], 23000, 0.8
[CLEANUP], 24000, 2.2
[CLEANUP], 25000, 1.0
[UPDATE], Operations, 50158
[UPDATE], AverageLatency(us), 16834.674428804978
[UPDATE], MinLatency(us), 108
[UPDATE], MaxLatency(us), 3411724
[UPDATE], Return=OK, 50158
[UPDATE], 0, 46975.64919354839
[UPDATE], 1000, 13951.572641509434
[UPDATE], 2000, 13051.910188679245
[UPDATE], 3000, 21315.29765258216
[UPDATE], 4000, 16659.031869078382
[UPDATE], 5000, 15918.690909090908
[UPDATE], 6000, 7915.130755064457
[UPDATE], 7000, 33326.38779956427
[UPDATE], 8000, 15245.27909090909
[UPDATE], 9000, 6885.2996183206105
[UPDATE], 10000, 27737.92644628099
[UPDATE], 11000, 16638.22186234818
[UPDATE], 12000, 14648.969454545455
[UPDATE], 13000, 18217.728251121076
[UPDATE], 14000, 19588.281783681214
[UPDATE], 15000, 23495.459196102314
[UPDATE], 16000, 25984.058378378377
[UPDATE], 17000, 11977.868553459119
[UPDATE], 18000, 14411.973372781065
[UPDATE], 19000, 16643.372675828618
[UPDATE], 20000, 12785.329568106312
[UPDATE], 21000, 13717.353928811282
[UPDATE], 22000, 13289.366644606222
[UPDATE], 23000, 17479.954128440368
[UPDATE], 24000, 17687.766758494032
[UPDATE], 25000, 13629.931060044477
[UPDATE], 26000, 14835.731459797034
[UPDATE], 27000, 12802.652022315202
[UPDATE], 28000, 14276.537433155081
[UPDATE], 29000, 73509.3078817734
[UPDATE], 30000, 13908.498876404494
[UPDATE], 31000, 73364.98895027624
[UPDATE], 32000, 21274.354881266492
[UPDATE], 33000, 25848.263975155278
[UPDATE], 34000, 14332.269579554822
[UPDATE], 35000, 14924.67051509769
[UPDATE], 36000, 11091.668449197861
[UPDATE], 37000, 18551.228323699423
[UPDATE], 38000, 15126.681899641577
[UPDATE], 39000, 16909.62109375
[UPDATE], 40000, 13046.216981132075
[UPDATE], 41000, 12014.037294015612
[UPDATE], 42000, 7941.774793388429
[UPDATE], 43000, 9917.02278177458
[UPDATE], 44000, 12848.740495867769
[UPDATE], 45000, 8505.50779896014
[UPDATE], 46000, 6989.919753086419
[UPDATE], 47000, 4578.615384615385